[NoCoverage] BlockStatement
1/course--hands-on--react/src/app.tsx:5:23
 import { Scoreboard } from "./components/Scoreboard";
 import { Top } from "./components/Top/Top";
 
-const App: FC = () => {
-  return (
-    <>
-      <Top feature="Flag" firstAction="Ctrl" secondAction="Click">
-        Minesweeper
-      </Top>
-      <Scoreboard
-        time="000"
-        levels={["Begginer", "Intermediate", "Expert"]}
-        mines="010"
-        onReset={() => null}
-      />
-    </>
-  );
-};
+const App: FC = () => {};
 
 export default App;

[NoCoverage] StringLiteral
1/course--hands-on--react/src/app.tsx:13:46
       </Top>
       <Scoreboard
         time="000"
-        levels={["Begginer", "Intermediate", "Expert"]}
+        levels={["Begginer", "Intermediate", ""]}
         mines="010"
         onReset={() => null}

[NoCoverage] StringLiteral
1/course--hands-on--react/src/app.tsx:13:30
       </Top>
       <Scoreboard
         time="000"
-        levels={["Begginer", "Intermediate", "Expert"]}
+        levels={["Begginer", "", "Expert"]}
         mines="010"
         onReset={() => null}
