[Timeout] BlockStatement
src/components/Grid/Cell.tsx:31:60
 export const Cell: FC<CellProps> = ({ children, coords, ...rest }) => {
   const [mouseDown, onMouseDown, onMouseUp] = useMouse();
 
-  const onContextMenu = (elem: MouseEvent<HTMLElement>) => {
-    /**
-     * Prevent context menu by default
-     */
-    elem.preventDefault();
-    if (isActiveCell(children)) {
-      rest.onContextMenu(coords);
-    }
-  };
+  const onContextMenu = (elem: MouseEvent<HTMLElement>) => {};
 
   const onClick = () => isActiveCell(children) && rest.onClick(coords);

[Timeout] ConditionalExpression
src/components/Grid/Cell.tsx:36:9
      * Prevent context menu by default
      */
     elem.preventDefault();
-    if (isActiveCell(children)) {
+    if (false) {
       rest.onContextMenu(coords);
     }

[Timeout] ConditionalExpression
src/components/Grid/Cell.tsx:36:9
      * Prevent context menu by default
      */
     elem.preventDefault();
-    if (isActiveCell(children)) {
+    if (true) {
       rest.onContextMenu(coords);
     }

[Killed] ArrowFunction
src/components/Grid/Cell.tsx:41:19
     }
   };
 
-  const onClick = () => isActiveCell(children) && rest.onClick(coords);
+  const onClick = () => undefined;
 
   const props = {
killedBy: Cell Component onClick and onContextMenu hanler should be called only for active cells
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:41:25
     }
   };
 
-  const onClick = () => isActiveCell(children) && rest.onClick(coords);
+  const onClick = () => true;
 
   const props = {
killedBy: Cell Component onClick and onContextMenu hanler should be called only for active cells
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/components/Grid/Cell.tsx:50:20
     onMouseDown,
     onMouseUp,
     onMouseLeave: onMouseUp,
-    "data-testid": `${children}_${coords}`,
+    "data-testid": ``,
   };
 
killedBy: Cell Component check prevent default contextMenu for every type of cell
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="0_1,1"]

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="css-1ne0sj1"
      data-testid=""

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:76:5
   switch (children) {
     case CellState.empty:
       return <RevealedFrame {...nonActiveCellProps} />;
-    case CellState.hidden:
-      return <ClosedFrame {...rest} />;
+    case CellState.hidden:
     case CellState.bomb:
       return (
killedBy: Cell Component onClick and onContextMenu hanler should be called only for active cells
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ConditionalExpression
src/components/Grid/Cell.tsx:78:5
       return <RevealedFrame {...nonActiveCellProps} />;
     case CellState.hidden:
       return <ClosedFrame {...rest} />;
-    case CellState.bomb:
-      return (
-        <BombFrame {...nonActiveCellProps}>
-          <Bomb />
-        </BombFrame>
-      );
+    case CellState.bomb:
     case CellState.flag:
       return (

[Survived] ConditionalExpression
src/components/Grid/Cell.tsx:90:5
           <Flag />
         </ClosedFrame>
       );
-    case CellState.weakFlag:
-      return (
-        <ClosedFrame {...rest}>
-          <WeaKFlag />
-        </ClosedFrame>
-      );
+    case CellState.weakFlag:
     default:
       return <RevealedFrame {...rest}>{children}</RevealedFrame>;

[Killed] ConditionalExpression
src/components/Grid/Cell.tsx:96:5
           <WeaKFlag />
         </ClosedFrame>
       );
-    default:
-      return <RevealedFrame {...rest}>{children}</RevealedFrame>;
+    default:
   }
 };
killedBy: Cell Component check prevent default contextMenu for every type of cell
statusReason: Error: ComponentsMap(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Survived] ArrowFunction
src/components/Grid/Cell.tsx:115:19
   height: 1.8vw;
   background-color: #d1d1d1;
   border: 0.6vh solid transparent;
-  border-color: ${({ mouseDown = false }) =>
-    mouseDown ? "transparent" : "#fff #9e9e9e #9e9e9e #fff"};
+  border-color: ${() => undefined};
   &:hover {
     filter: brightness(1.1);

[Survived] StringLiteral
src/components/Grid/Cell.tsx:116:33
   background-color: #d1d1d1;
   border: 0.6vh solid transparent;
   border-color: ${({ mouseDown = false }) =>
-    mouseDown ? "transparent" : "#fff #9e9e9e #9e9e9e #fff"};
+    mouseDown ? "transparent" : ""};
   &:hover {
     filter: brightness(1.1);

[Survived] StringLiteral
src/components/Grid/Cell.tsx:127:6
   0: "#000",
   1: "#2a48ec",
   2: "#2bb13d",
-  3: "#ec6561",
+  3: "",
   4: "#233db7",
   5: "#a6070f",

[Survived] StringLiteral
src/components/Grid/Cell.tsx:139:42
   12: transparent,
 };
 
-const RevealedFrame = styled(ClosedFrame)`
-  border-color: #dddddd;
-  cursor: default;
-  color: ${({ children }) => colors[children as CellType] ?? transparent};
-  &:hover {
-    filter: brightness(1);
-  }
-`;
+const RevealedFrame = styled(ClosedFrame)``;
 
 const Bomb = styled.div`
