[NoCoverage] ArrowFunction
src/components/Grid/Grid.tsx:21:36
    */
   onContextMenu: (coords: Coords) => void;
 }
-export const Grid: FC<GridProps> = ({ children, ...rest }) => (
-  <Wrapper size={children.length}>
-    {children.map((row, coordY) =>
-      row.map((cell, coordX) => (
-        <Cell
-          key={`${coordY}_${coordX}_${cell}`}
-          coords={[coordY, coordX]}
-          {...rest}
-        >
-          {cell}
-        </Cell>
-      ))
-    )}
-  </Wrapper>
-);
+export const Grid: FC<GridProps> = () => undefined;
 
 interface WrapperProps {

[NoCoverage] ArrowFunction
src/components/Grid/Grid.tsx:23:19
 }
 export const Grid: FC<GridProps> = ({ children, ...rest }) => (
   <Wrapper size={children.length}>
-    {children.map((row, coordY) =>
-      row.map((cell, coordX) => (
-        <Cell
-          key={`${coordY}_${coordX}_${cell}`}
-          coords={[coordY, coordX]}
-          {...rest}
-        >
-          {cell}
-        </Cell>
-      ))
+    {children.map(() => undefined
     )}
   </Wrapper>

[NoCoverage] ArrowFunction
src/components/Grid/Grid.tsx:24:15
 export const Grid: FC<GridProps> = ({ children, ...rest }) => (
   <Wrapper size={children.length}>
     {children.map((row, coordY) =>
-      row.map((cell, coordX) => (
-        <Cell
-          key={`${coordY}_${coordX}_${cell}`}
-          coords={[coordY, coordX]}
-          {...rest}
-        >
-          {cell}
-        </Cell>
-      ))
+      row.map(() => undefined)
     )}
   </Wrapper>

[NoCoverage] StringLiteral
src/components/Grid/Grid.tsx:26:16
     {children.map((row, coordY) =>
       row.map((cell, coordX) => (
         <Cell
-          key={`${coordY}_${coordX}_${cell}`}
+          key={``}
           coords={[coordY, coordX]}
           {...rest}
