[NoCoverage] ArrowFunction
src/components/Scoreboard/Counter.tsx:11:42
   children: string;
 }
 
-export const Counter: FC<CounterProps> = ({ children }) => (
-  <Frame>{children}</Frame>
-);
+export const Counter: FC<CounterProps> = () => undefined;
 
 const Frame = styled.div`

[NoCoverage] StringLiteral
src/components/Scoreboard/Counter.tsx:15:25
   <Frame>{children}</Frame>
 );
 
-const Frame = styled.div`
-  display: inline-block;
-  padding: 0 0.3vw;
-  color: #ec433c;
-  border: 0.15vw inset;
-  line-height: 2vw;
-  letter-spacing: normal.08em;
-  background: #333;
-  text-shadow: 0 0 0.1vw;
-`;
+const Frame = styled.div``;
 
