[NoCoverage] ArrowFunction
src/components/Scoreboard/Level.tsx:11:38
   children: string[];
 }
 
-export const Level: FC<LevelProps> = ({ children }) => (
-  <Select>{children.map((item:string)=> (
-    <Option key={item} value={item} >{item}</Option>
-  ))}</Select>
-);
+export const Level: FC<LevelProps> = () => undefined;
 
 const Select = styled.select`

[NoCoverage] ArrowFunction
src/components/Scoreboard/Level.tsx:12:25
 }
 
 export const Level: FC<LevelProps> = ({ children }) => (
-  <Select>{children.map((item:string)=> (
-    <Option key={item} value={item} >{item}</Option>
-  ))}</Select>
+  <Select>{children.map(() => undefined)}</Select>
 );
 
