[NoCoverage] ArrowFunction
src/components/Scoreboard/ScoreBoard.tsx:26:48
   onReset: () => void;
 }
 
-export const Scoreboard: FC<ScoreboardProps> = ({
-  time,
-  levels,
-  mines,
-  onReset,
-}) => (
-  <Wrapper>
-    <Counter>{time}</Counter>
-    <Level>{levels}</Level>
-    <Reset onReset={onReset}/>
-    <Counter>{mines}</Counter>
-  </Wrapper>
-);
+export const Scoreboard: FC<ScoreboardProps> = () => undefined;
 
 const Wrapper = styled.div`
