[NoCoverage] ArrowFunction
src/components/Top/Legend.tsx:19:41
   secondAction: string;
 }
 
-export const Legend: FC<LegendsProps> = ({
-  feature,
-  firstAction,
-  secondAction,
-}) => (
-  <Parent>
-    <strong>{feature}: </strong>
-    <FlagComboParent>
-      <FirstAction>{firstAction}</FirstAction> +{" "}
-      <SecondAction>{secondAction}</SecondAction>
-    </FlagComboParent>
-  </Parent>
-);
+export const Legend: FC<LegendsProps> = () => undefined;
 
 const FlagComboParent = styled.code`

[NoCoverage] StringLiteral
src/components/Top/Legend.tsx:33:36
   </Parent>
 );
 
-const FlagComboParent = styled.code`
-  background: #e3e3e3;
-`;
+const FlagComboParent = styled.code``;
 
 const Parent = styled.legend`
