[NoCoverage] ArrowFunction
src/components/Top/Top.tsx:8:42
 
 export type TopComponentType = GameNameProps & LegendsProps;
 
-export const Top: FC<TopComponentType> = ({ children, ...legendProps }) => (
-  <Header>
-    <GameName>{children}</GameName>
-    <Legend {...legendProps} />
-  </Header>
-);
+export const Top: FC<TopComponentType> = () => undefined;
 
 const Header = styled.header`
