[Killed] BlockStatement
src/components/Scoreboard/Reset.tsx:12:55
   onReset: () => void;
 }
 
-export const Reset: FC<ResetProps> = ({ onReset }) => {
-  const [mouseDown, onMouseDown, onMouseUp] = useMouse();
-
-  return (
-    <Button
-      onClick={onReset}
-      onMouseDown={onMouseDown}
-      onMouseUp={onMouseUp}
-      onMouseLeave={onMouseUp}
-    >
-      {mouseDown ? "😮" : "🙂"}
-    </Button>
-  );
-};
+export const Reset: FC<ResetProps> = ({ onReset }) => {};
 
 const Button = styled.button`
killedBy: Reset Component should render elements with default state
statusReason: Error: Reset(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
