[Killed] BlockStatement
src/components/hooks/useMouse.ts:6:80
 export type setMouseDownStatus = () => void;
 export type setMouseUpStatus = () => void;
 
-export const useMouse = (): [boolean, setMouseDownStatus, setMouseUpStatus] => {
-  const [mouseDown, setMouseDown] = useState(false);
-
-  // useDebugValue(
-  //   `mouseDown: ${mouseDown}`,
-  //   (str) => `${str} ${new Date().toISOString()} `
-  // );
-
-  const onMouseDown = () => setMouseDown(true);
-  const onMouseUp = () => setMouseDown(false);
-
-  return [mouseDown, onMouseDown, onMouseUp];
-};
+export const useMouse = (): [boolean, setMouseDownStatus, setMouseUpStatus] => {};
 
killedBy: Cell Component check prevent default contextMenu for every type of cell
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BooleanLiteral
src/components/hooks/useMouse.ts:7:46
 export type setMouseUpStatus = () => void;
 
 export const useMouse = (): [boolean, setMouseDownStatus, setMouseUpStatus] => {
-  const [mouseDown, setMouseDown] = useState(false);
+  const [mouseDown, setMouseDown] = useState(true);
 
   // useDebugValue(
killedBy: Reset Component should render elements with default state
statusReason: TestingLibraryElementError: Unable to find an element with the text: 🙂. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <button
      class="css-15ja8qh"
    >
