[Killed] ArrowFunction
course--hands-on--react/src/helpers/CellsManipulator.ts:3:34
 import { Cell, Coords, Field } from './Field';
 
-export const getNeigboursItems = ([y, x]: Coords): Record<
-  string,
-  [number, number]
-> => ({
-  top: [y - 1, x],
-  topRight: [y - 1, x + 1],
-  right: [y, x + 1],
-  rightBottom: [y + 1, x + 1],
-  bottom: [y + 1, x],
-  bottomLeft: [y + 1, x - 1],
-  left: [y, x - 1],
-  leftTop: [y - 1, x - 1],
-});
+export const getNeigboursItems = () => undefined;
 
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"bottom": [1, 0], "bottomLeft": [1, -1], "left": [0, -1], "leftTop": [-1, -1], "right": [0, 1], "rightBottom": [1, 1], "top": [-1, 0], "topRight": [-1, 1]}
Received: undefined

[Killed] ObjectLiteral
course--hands-on--react/src/helpers/CellsManipulator.ts:6:7
 export const getNeigboursItems = ([y, x]: Coords): Record<
   string,
   [number, number]
-> => ({
-  top: [y - 1, x],
-  topRight: [y - 1, x + 1],
-  right: [y, x + 1],
-  rightBottom: [y + 1, x + 1],
-  bottom: [y + 1, x],
-  bottomLeft: [y + 1, x - 1],
-  left: [y, x - 1],
-  leftTop: [y - 1, x - 1],
-});
+> => ({});
 
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
killedBy: Check neigbours selectors With [0, 0] coords
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 34
+ Received  +  1

- Object {
-   "bottom": Array [
-     1,

[Killed] EqualityOperator
course--hands-on--react/src/helpers/CellsManipulator.ts:18:3
 });
 
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
-  y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
+  y < 0 && x >= 0 && length - y > 0 && length - x > 0;
 
 export const incrementNeibours = (coords: Coords, field: Field): Field => {
killedBy: checkItemInField tests Simple cases In x and y range
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
course--hands-on--react/src/helpers/CellsManipulator.ts:18:23
 });
 
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
-  y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
+  y >= 0 && x >= 0 && length - y <= 0 && length - x > 0;
 
 export const incrementNeibours = (coords: Coords, field: Field): Field => {
killedBy: checkItemInField tests Simple cases Out of y range
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
course--hands-on--react/src/helpers/CellsManipulator.ts:20:75
 export const checkItemInField = ([y, x]: Coords, { length }: Field): boolean =>
   y >= 0 && x >= 0 && length - y > 0 && length - x > 0;
 
-export const incrementNeibours = (coords: Coords, field: Field): Field => {
-  const items = getNeigboursItems(coords);
-
-  for (const item of Object.values(items)) {
-    if (checkItemInField(item, field)) {
-      const [y, x] = item;
-      const cell = field[y][x];
-      if (cell < 8) {
-        field[y][x] = (cell + 1) as Cell;
-      }
-    }
-  }
-
-  return field;
-};
+export const incrementNeibours = (coords: Coords, field: Field): Field => {};
killedBy: Check Increment Neibours Simple cases Field with only one item
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [[9]]
Received: undefined

[Killed] BlockStatement
course--hands-on--react/src/helpers/CellsManipulator.ts:24:40
   const items = getNeigboursItems(coords);
 
   for (const item of Object.values(items)) {
-    if (checkItemInField(item, field)) {
-      const [y, x] = item;
-      const cell = field[y][x];
-      if (cell < 8) {
-        field[y][x] = (cell + 1) as Cell;
-      }
-    }
+    if (checkItemInField(item, field)) {}
   }
 
killedBy: Check Increment Neibours Simple cases Field 2x2 with one mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    Array [
      9,
