[Killed] ArrowFunction
course--hands-on--react/src/helpers/Field.ts:14:36
   weakFlag: 12,
 };
 
-export const emptyFieldGenerator = (
-  size: number,
-  state: Cell = CellState.empty
-): Field => new Array(size).fill(null).map(() => new Array(size).fill(state));
+export const emptyFieldGenerator = () => undefined;
 
 export const fieldGenerator = (size: number, probability: number): Field => {
killedBy: Field Generator emptyFieldGenerator tests 2x2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: [[0, 0], [0, 0]]
Received: undefined

[Killed] ArrowFunction
course--hands-on--react/src/helpers/Field.ts:17:44
 export const emptyFieldGenerator = (
   size: number,
   state: Cell = CellState.empty
-): Field => new Array(size).fill(null).map(() => new Array(size).fill(state));
+): Field => new Array(size).fill(null).map(() => undefined);
 
 export const fieldGenerator = (size: number, probability: number): Field => {
killedBy: Field Generator emptyFieldGenerator tests 2x2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 2

  Array [
-   Array [
-     0,

[Killed] ArrayDeclaration
course--hands-on--react/src/helpers/Field.ts:17:50
 export const emptyFieldGenerator = (
   size: number,
   state: Cell = CellState.empty
-): Field => new Array(size).fill(null).map(() => new Array(size).fill(state));
+): Field => new Array(size).fill(null).map(() => new Array().fill(state));
 
 export const fieldGenerator = (size: number, probability: number): Field => {
killedBy: Field Generator emptyFieldGenerator tests 2x2
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 8
+ Received  + 2

  Array [
-   Array [
-     0,

[Killed] BlockStatement
course--hands-on--react/src/helpers/Field.ts:19:77
   state: Cell = CellState.empty
 ): Field => new Array(size).fill(null).map(() => new Array(size).fill(state));
 
-export const fieldGenerator = (size: number, probability: number): Field => {
-  if (probability < 0 || probability > 1) {
-    throw new Error('Probability must be between 0 and 1');
-  }
-
-  let unprocessedCells = size * size;
-  let restCellsWithBombs = unprocessedCells * probability;
-
-  const result: Field = emptyFieldGenerator(size);
-
-  for (let y = 0; y < size; y++) {
-    for (let x = 0; x < size; x++) {
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[y][x] = CellState.bomb;
-        incrementNeibours([y, x], result);
-        restCellsWithBombs--;
-      }
-      unprocessedCells--;
-    }
-  }
-
-  return result;
-};
+export const fieldGenerator = (size: number, probability: number): Field => {};
killedBy: Field Generator Simple cases Wrong dencity
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Probability must be between 0 and 1"

Received function did not throw

[Killed] ConditionalExpression
course--hands-on--react/src/helpers/Field.ts:20:26
 ): Field => new Array(size).fill(null).map(() => new Array(size).fill(state));
 
 export const fieldGenerator = (size: number, probability: number): Field => {
-  if (probability < 0 || probability > 1) {
+  if (probability < 0 || true) {
     throw new Error('Probability must be between 0 and 1');
   }
killedBy: Field Generator Simple cases Smallest possible field without mine
statusReason: Error: Probability must be between 0 and 1

[Killed] EqualityOperator
course--hands-on--react/src/helpers/Field.ts:20:7
 ): Field => new Array(size).fill(null).map(() => new Array(size).fill(state));
 
 export const fieldGenerator = (size: number, probability: number): Field => {
-  if (probability < 0 || probability > 1) {
+  if (probability <= 0 || probability > 1) {
     throw new Error('Probability must be between 0 and 1');
   }
killedBy: Field Generator Simple cases Smallest possible field without mine
statusReason: Error: Probability must be between 0 and 1

[Killed] StringLiteral
course--hands-on--react/src/helpers/Field.ts:21:21
 
 export const fieldGenerator = (size: number, probability: number): Field => {
   if (probability < 0 || probability > 1) {
-    throw new Error('Probability must be between 0 and 1');
+    throw new Error("");
   }
 
killedBy: Field Generator Simple cases Wrong dencity
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Probability must be between 0 and 1"
Received message:   ""

      89 |       } else {
      90 |         stryCov_9fa48("163");
    > 91 |         throw new Error(stryMutAct_9fa48("164") ? "" : (stryCov_9fa48("164"), 'Probability must be between 0 and 1'));

[Killed] ConditionalExpression
course--hands-on--react/src/helpers/Field.ts:29:19
 
   const result: Field = emptyFieldGenerator(size);
 
-  for (let y = 0; y < size; y++) {
+  for (let y = 0; false; y++) {
     for (let x = 0; x < size; x++) {
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] EqualityOperator
course--hands-on--react/src/helpers/Field.ts:29:19
 
   const result: Field = emptyFieldGenerator(size);
 
-  for (let y = 0; y < size; y++) {
+  for (let y = 0; y >= size; y++) {
     for (let x = 0; x < size; x++) {
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] ConditionalExpression
course--hands-on--react/src/helpers/Field.ts:30:21
   const result: Field = emptyFieldGenerator(size);
 
   for (let y = 0; y < size; y++) {
-    for (let x = 0; x < size; x++) {
+    for (let x = 0; false; x++) {
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
         result[y][x] = CellState.bomb;
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] BlockStatement
course--hands-on--react/src/helpers/Field.ts:30:36
   const result: Field = emptyFieldGenerator(size);
 
   for (let y = 0; y < size; y++) {
-    for (let x = 0; x < size; x++) {
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[y][x] = CellState.bomb;
-        incrementNeibours([y, x], result);
-        restCellsWithBombs--;
-      }
-      unprocessedCells--;
-    }
+    for (let x = 0; x < size; x++) {}
   }
 
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] BlockStatement
course--hands-on--react/src/helpers/Field.ts:31:66
 
   for (let y = 0; y < size; y++) {
     for (let x = 0; x < size; x++) {
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[y][x] = CellState.bomb;
-        incrementNeibours([y, x], result);
-        restCellsWithBombs--;
-      }
+      if (restCellsWithBombs / unprocessedCells > Math.random()) {}
       unprocessedCells--;
     }
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,

[Killed] EqualityOperator
course--hands-on--react/src/helpers/Field.ts:31:11
 
   for (let y = 0; y < size; y++) {
     for (let x = 0; x < size; x++) {
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
+      if (restCellsWithBombs / unprocessedCells <= Math.random()) {
         result[y][x] = CellState.bomb;
         incrementNeibours([y, x], result);
killedBy: Field Generator Simple cases Smallest possible field without mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     0,

[Killed] UpdateOperator
course--hands-on--react/src/helpers/Field.ts:34:9
       if (restCellsWithBombs / unprocessedCells > Math.random()) {
         result[y][x] = CellState.bomb;
         incrementNeibours([y, x], result);
-        restCellsWithBombs--;
+        restCellsWithBombs++;
       }
       unprocessedCells--;
killedBy: Field Generator Simple cases 2x2 field with 50% probability
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 3
Received array:  [9, 9, 9]
