[Killed] LogicalOperator
src/components/Grid/Cell.tsx:41:25
     }
   };
 
-  const onClick = () => isActiveCell(children) && rest.onClick(coords);
+  const onClick = () => isActiveCell(children) || rest.onClick(coords);
 
   const props = {
killedBy: Cell Component onClick and onContextMenu hanler should be called only for active cells
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: [1, 1]
