[Survived] StringLiteral
components/Grid/__snapshots__/Cell.stories.snap.js:3:9
 // Jest Snapshot v1, https://goo.gl/fbAQLP
 
-exports[`Storyshots Grid/Cell Cell Bomb 1`] = `
+exports[``] = `
 <div
   className="css-c52ynp"

[Survived] StringLiteral
components/Grid/__snapshots__/Cell.stories.snap.js:15:9
 </div>
 `;
 
-exports[`Storyshots Grid/Cell Cell Closed 1`] = `
+exports[``] = `
 <div
   className="css-17s3mwu"

[Survived] StringLiteral
components/Grid/__snapshots__/Cell.stories.snap.js:15:49
 </div>
 `;
 
-exports[`Storyshots Grid/Cell Cell Closed 1`] = `
-<div
-  className="css-17s3mwu"
-  data-testid="10_1,1"
-  onClick={[Function]}
-  onContextMenu={[Function]}
-  onMouseDown={[Function]}
-  onMouseLeave={[Function]}
-  onMouseUp={[Function]}
-/>
-`;
+exports[`Storyshots Grid/Cell Cell Closed 1`] = ``;
 
 exports[`Storyshots Grid/Cell Cell Empty 1`] = `

[Survived] StringLiteral
components/Grid/__snapshots__/Cell.stories.snap.js:27:9
 />
 `;
 
-exports[`Storyshots Grid/Cell Cell Empty 1`] = `
+exports[``] = `
 <div
   className="css-1ne0sj1"

[Survived] StringLiteral
components/Grid/__snapshots__/Cell.stories.snap.js:35:9
 />
 `;
 
-exports[`Storyshots Grid/Cell Cell Flag 1`] = `
+exports[``] = `
 <div
   className="css-17s3mwu"
