[Survived] StringLiteral
components/Grid/__snapshots__/Grid.stories.snap.js:3:9
 // Jest Snapshot v1, https://goo.gl/fbAQLP
 
-exports[`Storyshots Grid/Grid Grid Example 1`] = `
+exports[``] = `
 <div
   className="css-2gtdmb"
