[Survived] StringLiteral
components/Scoreboard/__snapshots__/Level.stories.snap.js:3:58
 // Jest Snapshot v1, https://goo.gl/fbAQLP
 
-exports[`Storyshots Scoreboard/Level Level Example 1`] = `
-<select
-  className="css-oyqqd"
->
-  <option
-    className="css-zcmdxr"
-    value="Beginner"
-  >
-    Beginner
-  </option>
-  <option
-    className="css-zcmdxr"
-    value="Intermediate"
-  >
-    Intermediate
-  </option>
-  <option
-    className="css-zcmdxr"
-    value="Expert"
-  >
-    Expert
-  </option>
-</select>
-`;
+exports[`Storyshots Scoreboard/Level Level Example 1`] = ``;
 
