[Survived] StringLiteral
components/Scoreboard/__snapshots__/Scoreboard.stories.snap.js:3:9
 // Jest Snapshot v1, https://goo.gl/fbAQLP
 
-exports[`Storyshots Scoreboard/Scoreboard Scoreboard Example 1`] = `
+exports[``] = `
 <div
   className="css-1gexv9m"
