[Survived] StringLiteral
components/Top/__snapshots__/GameName.stories.snap.js:3:9
 // Jest Snapshot v1, https://goo.gl/fbAQLP
 
-exports[`Storyshots Top/GameName Minesweeper Game Name 1`] = `
+exports[``] = `
 <h1
   className="css-18kvaxm"
