[Killed] BlockStatement
course--hands-on--react/src/helpers/Field.ts:29:34
 
   const result: Field = emptyFieldGenerator(size);
 
-  for (let y = 0; y < size; y++) {
-    for (let x = 0; x < size; x++) {
-      if (restCellsWithBombs / unprocessedCells > Math.random()) {
-        result[y][x] = CellState.bomb;
-        incrementNeibours([y, x], result);
-        restCellsWithBombs--;
-      }
-      unprocessedCells--;
-    }
-  }
+  for (let y = 0; y < size; y++) {}
 
   return result;
killedBy: Field Generator Simple cases Smallest possible field with mine
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Array [
-     9,
